app/views/movies/_forms.html.erb

SELECT "genres".* FROM "genres"
---
  <%= form.label 'Gênero' %>
  <%= form.collection_select :genre_id, Genre.all, :id, :name %><br><br>

SELECT "directors".* FROM "directors"
---
  <%= form.label 'Diretor' %>
  <%= form.collection_select :director_id, Director.all, :id, :name %><br><br>