app/views/directors/_forms.html.erb

SELECT "genres".* FROM "genres"
---
  <%= form.label 'Genero favorito' %>
  <%= form.collection_select :genre_id, Genre.all, :id, :name %><br><br>