app/controllers/directors_controller.rb

  def index
    @directors = Director.all
---
SELECT "directors".* FROM "directors"

  def show
    @director = Director.find(params[:id])
    @movies = Movie.where(director_id: params[:id])
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director_id" = ?  [["director_id", 1]]

  def create
    @director = Director.new(params.require(:director).permit(:name, :nationality, :birth_date, :genre_id))

    if(@director.save)
---
INSERT INTO "directors" ("name", "nationality", "birth_date", "created_at", "updated_at", "genre_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Francisco"], ["nationality", "Brasil"], ["birth_date", "26-19-2011"], ["created_at", "2024-04-10 17:44:26.393370"], ["updated_at", "2024-04-10 17:44:26.393370"], ["genre_id", 4]]

  def edit
    @director = Director.find(params[:id])
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @director = Director.find(params[:id])

    if @director.update(params.require(:director).permit(:name, :nationality, :birth_date, :genre_id))
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "directors" SET "nationality" = ?, "updated_at" = ? WHERE "directors"."id" = ?  [["nationality", "Russians"], ["updated_at", "2024-04-11 23:15:17.050931"], ["id", 1]]