app/controllers/genres_controller.rb

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."genre_id" = ?  [["genre_id", 1]]
---
  def show
    @genre = Genre.find(params[:id])
    @movies = Movie.where(genre_id: params[:id])

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "dasdada"], ["created_at", "2024-04-12 00:43:02.060713"], ["updated_at", "2024-04-12 00:43:02.060713"]]
---
  def create
    @genre = Genre.new(params.require(:genre).permit(:name))

    if(@genre.save)

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "Romance"], ["updated_at", "2024-04-10 23:22:44.628186"], ["id", 1]]
---
  def update
    @genre = Genre.find(params[:id])

    if @genre.update(params.require(:genre).permit(:name))