app/controllers/movies_controller.rb

  def index
    @current_date = Date.today
    @movies = Movie.all
---
SELECT "movies".* FROM "movies"

  def show
    @current_date = Date.today
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @movie = Movie.new(params.require(:movie).permit(:title, :release_year, :synopsis, :country, :film_runtime, :genre_id, :director_id, :poster))

    if(@movie.save)
---
INSERT INTO "movies" ("title", "synopsis", "country", "film_runtime", "created_at", "updated_at", "genre_id", "director_id", "release_year", "poster") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    @movie = Movie.find(params[:id])

    if @movie.update(params.require(:movie).permit(:title, :release_year, :synopsis, :country, :film_runtime, :genre_id, :director_id, :poster))
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "movies" SET "updated_at" = ?, "genre_id" = ?, "director_id" = ? WHERE "movies"."id" = ?  [["updated_at", "2024-04-10 18:12:48.545935"], ["genre_id", 3], ["director_id", 2], ["id", 1]]